Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The new angle to set the camera view to
zh_cn: 要设置相机视图的新角度

source: The new byte value.
zh_cn: 新的字节值。

source: The new caption.
zh_cn: 新标题。

source: The new depth for the layer
zh_cn: 图层的新深度

source: The new direction.
zh_cn: 新的方向。

source: The new epsilon value (from 0 to 0.999999999).
zh_cn: 新的值(从0到0.999999999)。

source: The new extension to use.
zh_cn: 要使用的新扩展名。

source: The new game speed (as either FPS or MPF).
zh_cn: 新的游戏速度(FPS或MPF)。

source: The new height (in pixels)
zh_cn: 新的高度(像素)

source: The new height of the grid.
zh_cn: 网格的新高度。

source: The new height of the room in pixels.
zh_cn: 房间的新高度，以像素为单位。

source: The new height of the window.
zh_cn: 窗口的新高度。

source: The new index for the animation frame.
zh_cn: 动画帧的新索引。

source: The new index of the path.
zh_cn: 路径的新索引。

source: The new layer ID
zh_cn: 新的图层ID

source: The new mass that you want the fixture to have.
zh_cn: 你想要的夹具的新质量。

source: The new name to give the file.
zh_cn: 给文件指定的新名称。

source: The new object the calling object will change into.
zh_cn: 调用对象将变为的新对象。

source: The new path is created in the process, and the index is returned to be used in all further calls to use this new path.
zh_cn: 在这个过程中创建了新路径，并返回索引，以便在所有进一步的调用中使用这个新路径。

source: The new position for the animation track.
zh_cn: 动画轨迹的新位置。

source: The new priority of the value.
zh_cn: 值的新优先级。

source: The new resolution value (in milliseconds) or -1 for default
zh_cn: 新的分辨率值(以毫秒为单位),默认值为-1

source: The new size for the array (an integer, starting from 0).
zh_cn: 数组的新大小(从0开始的整数)。

source: The new size of the buffer (in bytes).
zh_cn: 缓冲区的新大小(以字节为单位)。

source: The new solidity of the object (true=solid, false=not solid).
zh_cn: 对象的新固体性(true=固体，false=非固体)。

source: The new speed factor of the point.
zh_cn: 点的新速度乘数。

source: The new speed.`
zh_cn: 新的速度。

source: The new sprite index to use
zh_cn: 要使用的新精灵索引

source: The new sprite to use as the object's mask.
zh_cn: 用作对象蒙版的新精灵。

source: The new substring to replace the previous one(s).
zh_cn: 用于替换前一个子字符串的新子字符串。

source: The new substring to replace the previous one.
zh_cn: 替换前一个子字符串的新子字符串。

source: The new threshold value (from 0 - 1, default 0.5).
zh_cn: 新的阈值(从0 - 1，默认为0.5)。

source: The new tile set index to use
zh_cn: 要使用的新切片集索引

source: The new value for all grid cells.
zh_cn: 所有网格单元格的新值。

source: The new value for the joint property
zh_cn: 共同属性的新值

source: The new value to replace the given value with
zh_cn: 要替换给定值的新值

source: The new value to replace the given value with.
zh_cn: 用来替换给定值的新值。

source: The new value(s) for that parameter as a real or array
zh_cn: 该参数的新值，为实数或数组

source: The new visibility of the object (true=visible, false=invisible).
zh_cn: 对象的新可见性(true=可见，false=不可见)。

source: The new width (in pixels)
zh_cn: 新的宽度(像素)

source: The new width of the grid.
zh_cn: 网格的新宽度。

source: The new width of the room in pixels.
zh_cn: 房间的新宽度，以像素为单位。

source: The new width of the window.
zh_cn: 窗口的新宽度。

source: The new x coordinate (relative to the path) of the point.
zh_cn: 点的新x坐标(相对于路径)。

source: The new x coordinate of the particle system.
zh_cn: 粒子系统的新x坐标。

source: The new x coordinate of the window.
zh_cn: 窗口的新x坐标。

source: The new x position
zh_cn: 新的x坐标

source: The new x position within the window.
zh_cn: 窗口内的新 x 位置。

source: The new y coordinate (relative to the path) of the point.
zh_cn: 点的新y坐标(相对于路径)。

source: The new y coordinate of the particle system.
zh_cn: 粒子系统的新的y坐标。

source: The new y coordinate of the window.
zh_cn: 窗口的新y坐标。

source: The new y position
zh_cn: 新的y位置

source: The new y position within the window.
zh_cn: 窗口内的新 y 位置。

source: The normal draw event.
zh_cn: 通用绘制事件

source: The notification message text (a string)
zh_cn: 通知消息文本(字符串)

source: The notification title (a string)
zh_cn: 通知标题(字符串)

source: The number (score) to add.
zh_cn: 要添加的数字(分数)。

source: The number does not have to be divisible by ten, however, but this will still return an appropriate value, for example if we have log10(101) we get 2.00432137... which is how many times you could divide 101 by 10.
zh_cn: 然而，这个数不一定能被10整除，但这仍然会返回一个适当的值，例如，如果我们有log10(101 ),我们得到2.00432137...也就是101除以10的次数。

source: The number of arguments (0 - 10)
zh_cn: 参数的数量(0 - 10)

source: The number of arguments to (from the offset onwards)
zh_cn: 参数的数量(从偏移量开始)

source: The number of bytes to set as the "used" size.
zh_cn: 要设置为"已使用"大小的字节数。

source: The number of characters to remove.
zh_cn: 要移除的字符数。

source: The number of characters, starting from the position of the first, to copy
zh_cn: 要复制的字符数，从第一个字符开始

source: The number of days (must be an integer) to add.
zh_cn: 要添加的天数(必须是整数)。

source: The number of decimal places to be included.
zh_cn: 要包含的小数位数。

source: The number of degrees either side of the current direction that the instance can check for a collision
zh_cn: 实例可以检查碰撞的当前方向任一侧的度数

source: The number of degrees either side of the current direction that the instance can rotate in a step
zh_cn: 实例在一个步骤中可以旋转的当前方向任一侧的度数

source: The number of elements to concatenate (allows negative values, reverse traversing).
zh_cn: 要连接的元素数量(允许负值、反向遍历)。

source: The number of elements to join (allows negative values, reverse traversing).
zh_cn: 要连接的元素数量(允许负值、反向遍历)。

source: The number of entires to read from the buffer.
zh_cn: 从缓冲区读取的条目数。

source: The number of event to call, between 0 and 15.
zh_cn: 要调用的事件数，介于0和15之间。

source: The number of frames the sprite will be cut up into horizontally.
zh_cn: 精灵将被水平分割成的帧数。

source: The number of horizontal pixels to shift the path.
zh_cn: 移动路径的水平像素数。

source: The number of hours (must be an integer) to add.
zh_cn: 要添加的小时数(必须是整数)。

source: The number of iterations to execute (allows negative values, reverse traversing).
zh_cn: 要执行的迭代次数(允许负值、反向遍历)。

source: The number of milliseconds for the sleep margin
zh_cn: 休眠余量的毫秒数

source: The number of minutes (must be an integer) to add.
zh_cn: 要添加的分钟数(必须是整数)。

source: The number of months (must be an integer) to add.
zh_cn: 要添加的月数(必须为整数)。

source: The number of particles to create per step.
zh_cn: 每步要创建的粒子数。

source: The number of particles to create.
zh_cn: 要创建的粒子数。

source: The number of players to request space for
zh_cn: 请求空间的玩家数量

source: The number of positions from the given index to check
zh_cn: 从给定索引中检查的位置数

source: The number of repetitions the time source should perform
zh_cn: 时间源应该执行的重复次数

source: The number of seconds (must be an integer) to add.
zh_cn: 要添加的秒数(必须为整数)。

source: The number of stage "slots" available will depend on the platform you are compiling to, with a maximum of 8 being available for Windows, Mac and Linux, but on lower end Android devices (for example) this number can be as low as 2.
zh_cn: 可用的阶段"插槽"的数量取决于编译到的平台，Windows、Mac和Linux最多可使用8个，但在低端Android设备上(例如)，这个数字可能低至2。

source: The number of steps ahead that the instance can check for a collision.
zh_cn: 实例可以检查碰撞的提前步数。

source: The number of steps the motion will be broken down into to resolve collisions, defaults to 4
zh_cn: 为解决冲突而将运动分解为的步数，默认为4

source: The number of the instance to find.
zh_cn: 要查找的实例的编号。

source: The number of times to repeat the string.
zh_cn: 重复字符串的次数。

source: The number of values to delete.
zh_cn: 要删除的值的数量。

source: The number of vertical pixels to shift the path.
zh_cn: 用于移动路径的垂直像素数。

source: The number of vertices the buffer should have.
zh_cn: 缓冲区应该拥有的顶点数量。

source: The number of weeks (must be an integer) to add.
zh_cn: 要添加的周数(必须为整数)。

source: The number of years (must be an integer) to add.
zh_cn: 要添加的年数(必须为整数)。

source: The number to change.
zh_cn: 要更改的数值。

source: The number to floor.
zh_cn: 要向下取整的数

source: The number to get the sign of.
zh_cn: 要获取其符号的数字。

source: The number to get the square root of.
zh_cn: 要计算平方根的数字。

source: The number to round.
zh_cn: 要舍入的数字。

source: The number to square.
zh_cn: 要平方的数字。

source: The number to turn absolute.
zh_cn: 要变成绝对值的数字。

source: The object (or instance id, or the keywords "all" or "other") to check for a collision with.
zh_cn: 要检查碰撞的对象(或实例id，或关键字"all"或"other")。

source: The object ID (or instance ID) for the camera view to follow (default is -1, no object).
zh_cn: 相机视图遵循的对象ID(或实例ID)(默认值为-1，无对象)。

source: The object can be an object index or a specific instance ID as well as the keyword other, and the distance is returned in pixels.
zh_cn: 对象可以是对象索引或特定实例ID以及关键字other，距离以像素为单位返回。

source: The object index of the object to create an instance of
zh_cn: 要创建其实例的对象的对象索引

source: The object index of the object within the sequence to override.
zh_cn: 要覆盖的序列中对象的对象索引。

source: The object index or instance ID to use to override the sequence objects.
zh_cn: 用于覆盖序列对象的对象索引或实例ID。

source: The object or instance to activate (the keyword all can also be used).
zh_cn: 要激活的对象或实例(也可以使用关键字all)。

source: The object or instance to check for the existence of.
zh_cn: 要检查是否存在的对象或实例。

source: The object or instance to deactivate (the keyword all can also be used).
zh_cn: 要停用的对象或实例(也可以使用关键字all)。

source: The object that is being checked as the ancestor (parent).
zh_cn: 作为祖先(父)被检查的对象。

source: The object that is being checked as the child.
zh_cn: 作为子级进行检查的对象。

source: The object that is to block the path of the instance running the function.
zh_cn: 阻塞运行函数的实例的路径的对象。

source: The object that is to block the path.
zh_cn: 要阻止路径的对象。

source: The object that should have its event triggered.
zh_cn: 应该触发其事件的对象。

source: The object to add an instance of.
zh_cn: 要添加其实例的对象。

source: The object to check against.
zh_cn: 要检查的对象。

source: The object to check for
zh_cn: 要检查的对象

source: The object to check for collisions with.
zh_cn: 要检查与其发生碰撞的对象。

source: The object to check for instance collisions.
zh_cn: 要检查实例碰撞的对象。

source: The object to check for instances of.
zh_cn: 要检查实例的对象。

source: The object to check for.
zh_cn: 要检查的对象。

source: The object to find the nth instance of
zh_cn: 要查找其第n个实例的对象

source: The object to total the number of instances of.
zh_cn: 要计算其实例总数的对象。

source: The object type that should be used for players
zh_cn: 应该用于玩家的对象类型

source: The offset into the argument array
zh_cn: 到参数数组的偏移量

source: The offset into the buffer to read the sample data from (in bytes).
zh_cn: 要从缓冲区中读取样例数据的偏移量(以字节为单位)。

source: The offset of the range (allows negative values, from end of string).
zh_cn: 范围的偏移量（允许负值，从字符串末尾开始）。

source: The offset position (in bytes) within the buffer to read the data from.
zh_cn: 要从中读取数据的缓冲区内的偏移位置（以字节为单位）。

source: The offset position (in bytes) within the buffer to read the given data from.
zh_cn: 缓冲区中要从中读取给定数据的偏移位置(以字节为单位)。

source: The offset position (in bytes) within the buffer to write the given data to.
zh_cn: 缓冲区中要写入给定数据的偏移位置(以字节为单位)。

source: The offset position to copy the data to (in bytes).
zh_cn: 将数据复制到的偏移位置(以字节为单位)。

source: The offset to be used when executing the function.
zh_cn: 执行函数时要使用的偏移量。

source: The offset to be used when looking through the array.
zh_cn: 查看数组时要使用的偏移量。

source: The offset to be used when searching the array.
zh_cn: 搜索数组时要使用的偏移量。

source: The offset to be used when shuffling the array.
zh_cn: 调整数组时要使用的偏移量。

source: The offset where to start putting the partial data in the new buffer (in bytes).
zh_cn: 开始将部分数据放入新缓冲区的偏移量(以字节为单位)。

source: The offset within the buffer to compress (in bytes).
zh_cn: 要压缩的缓冲区内的偏移量(以字节为单位)。

source: The offset within the buffer to load to (in bytes).
zh_cn: 要加载到的缓冲区内的偏移量(以字节为单位)。

source: The offset within the buffer to save from (in bytes).
zh_cn: 要保存的缓冲区内的偏移量(字节)。

source: The offset within the source buffer to start from.
zh_cn: 源缓冲区中开始的偏移量。

source: The offset within the the source buffer to copy from.
zh_cn: 要从中复制的源缓冲区中的偏移量。

source: The only time this is not required is when you have flagged any items in the list as another DS list or as a DS map, in which case these items will be destroyed (not cleared!) and their memory cleaned up automatically when the parent is cleared.
zh_cn: 唯一不需要这样做的时候是当你将列表中的任何项目标记为另一个DS列表或DS地图时，在这种情况下，这些项目将被销毁(不清除！)并且当父代被清除时，它们的内存被自动清除。

source: The only time this is not required is when you have flagged any items in the list as another DS list or as a DS map, in which case these items will be destroyed and their memory cleaned up automatically as well.
zh_cn: 唯一不需要这样做的时候是当你将列表中的任何项目标记为另一个DS列表或DS地图时，在这种情况下，这些项目将被销毁，它们的内存也会自动清理。

source: The only time this is not required is when you have flagged any items in the map as a DS list or as another DS map, in which case these items will be destroyed (not cleared!) and their memory cleaned up automatically when the parent map is cleared.
zh_cn: 唯一不需要这样做的情况是，当您将map中的任何项标记为DS列表或另一个DS map时，在这种情况下，这些项将被销毁(不是清除!)，并且当父映射被清除时，它们的内存将自动清除。

source: The only time this is not required is when you have flagged any items in the map as a DS list or as another DS map, in which case these items will be destroyed and their memory cleaned up automatically as well.
zh_cn: 唯一不需要这样做的情况是，当您将映射中的任何项标记为DS列表或另一个DS map时，在这种情况下，这些项将被销毁，它们的内存也将自动清除。

source: The option to set.
zh_cn: 要设置的选项。

source: The options available are as follows:
zh_cn: 可用的选项如下:

source: The order in which functions attached to cameras and the actual rendering of the camera view is as follows:
zh_cn: 相机附带的功能和相机视图的实际渲染顺序如下:

source: The order in which scripts attached to cameras and the actual rendering of the camera view is as follows:
zh_cn: 脚本附加到相机的顺序和相机视图的实际渲染如下:

source: The original DS map remains unchanged by this process.
zh_cn: 原始DS map在此过程中保持不变。

source: The original region will remain unchanged, while the region that they have been multiplied with will now store the new values for each cell.
zh_cn: 原始区域将保持不变，而与它们相乘的区域现在将存储每个单元格的新值。

source: The output gain of the bus.
zh_cn: 总线的输出增益。

source: The outside edge colour.
zh_cn: 外边缘颜色。

source: The parameter to send (a string).
zh_cn: 要发送的参数(字符串)。

source: The parent of the time source
zh_cn: 时间源的父级

source: The particle category (as defined when you created the particle or group to which it belongs).
zh_cn: 粒子类别(在创建其所属的粒子或组时定义)。

source: The particle category to set.
zh_cn: 要设置的粒子类别。

source: The particle group to get.
zh_cn: 要得到的粒子群。

source: The particle group to set.
zh_cn: 要设置的粒子组。

source: The particle index (its ID) is that which was returned by the function physics_particle_create(), and the buffer used must have been created previously using the function buffer_create().
zh_cn: 粒子索引(它的ID)是由函数physics_particle_create()返回的，使用的缓冲区必须是以前使用函数buffer_create()创建的。

source: The particle system ID
zh_cn: 粒子系统ID

source: The particle system ID value to get the layer ID of
zh_cn: 粒子系统ID值得到的层ID

source: The particle system that the emitter is in.
zh_cn: 发射器所在的粒子系统。

source: The particle system to check for an emitter.
zh_cn: 检查发射器的粒子系统。

source: The particle system to create the emitter in.
zh_cn: 创建发射器的粒子系统。

source: The particle system to destroy all emitters from.
zh_cn: 摧毁所有发射器的粒子系统。

source: The particle system to destroy the emitter from.
zh_cn: 摧毁发射器的粒子系统。

source: The particles are emitted following the distribution, shape and position set by the function part_emitter_region().
zh_cn: 粒子按照函数part_emitter_region()设置的分布、形状和位置发射。

source: The path being copied to will be cleared first (should it have any path points) and be completely overwritten by the path being copied from.
zh_cn: 复制到的路径将首先被清除(如果它有任何路径点),并被复制到的路径完全覆盖。

source: The path index to start.
zh_cn: 开始的路径索引。

source: The path of the font file in the Included Files (*.ttf or *.otf).
zh_cn: 包含文件(*.ttf或*.otf)中的字体文件的路径。

source: The path to draw
zh_cn: 要绘制的路径

source: The path will be drawn as a simple line, and can be either relative to the calling instance or at the absolute position it was created at in the path editor or through code.
zh_cn: 该路径将被绘制为一条简单的直线，可以相对于调用实例，也可以位于在路径编辑器中或通过代码创建它的绝对位置。

source: The perceived volume for a sound can change depending on the fall-off value and the position it has relative to the listener, but by setting the gain with this function, the full volume will never exceed the specified gain value.
zh_cn: 声音的感知音量可以根据衰减值和它相对于听者的位置而变化，但是通过使用此函数设置增益，整个音量将永远不会超过指定的增益值。

source: The percentage of the achievement completed.
zh_cn: 完成的成就的百分比。

source: The period of the time source
zh_cn: 时间源的周期

source: The permission to request (a string)
zh_cn: 请求的权限(字符串)

source: The pitch multiplier (default 1).
zh_cn: 音高乘数(默认为1)。

source: The place on the table (1-10).
zh_cn: 表中的位置(1-10)。

source: The placeholders should follow the format "{x}" where x is the index of the value in the array that it should be replaced with.
zh_cn: 占位符应该遵循"{x}"的格式，其中x是应该替换它的数组中值的索引。

source: The player id to get the info for
zh_cn: 要获取其信息的玩家id

source: The player id to get the input for
zh_cn: 要获取输入的玩家id

source: The player id to set the mock input for
zh_cn: 为其设置模拟输入的玩家id

source: The player which the message is sent to.
zh_cn: 消息发送到的player。

source: The playhead direction, a constant, listed above
zh_cn: 播放头方向，一个常量，列在上面

source: The point identity to check.
zh_cn: 要检查的点id。

source: The point will be added into the path before the point "n" that is specified in the function.
zh_cn: 该点将被添加到函数中指定的点"n"之前的路径中。

source: The pointer to the curve struct to destroy.
zh_cn: 指向要销毁的曲线结构的指针。

source: The polygon is closed when the fixture is bound to an instance.
zh_cn: 当夹具绑定到实例时，多边形是闭合的。

source: The polygon will then be used to delete all the particles that fall within the defined area.
zh_cn: 然后，该多边形将用于删除落在定义区域内的所有粒子。

source: The port that the server will use.
zh_cn: 服务器将使用的端口。

source: The port to connect to.
zh_cn: 要连接的端口。

source: The port to use
zh_cn: 要使用的端口

source: The position along the x-axis to get the tile data from (in room pixels)
zh_cn: 沿x轴获取图块数据的位置(以房间像素为单位)

source: The position along the y-axis to get the tile data from (in room pixels)
zh_cn: 沿y轴获取图块数据的位置(以房间像素为单位)

source: The position in characters of the string to insert the substring.
zh_cn: 字符串中要插入子字符串的字符位置。

source: The position in the file to move to.
zh_cn: 文件中要移动到的位置。

source: The position in time to check (from 0 to 1).
zh_cn: 要检查的时间位置（从0到1 ）。

source: The position of the edge is defined using local space, ie: the x/y position of the instance is considered (0,0), so this should be taken into consideration when creating them (in the code example below, the instance would have been placed at (0,0) in the room to avoid complications).
zh_cn: 边缘的位置是使用局部空间定义的，例如:实例的x/y位置被认为是(0,0)，所以在创建它们时应该考虑到这一点(在下面的代码示例中，实例将被放置在房间中的(0,0)位置，以避免复杂化)。

source: The position of the first character in the string to copy from (numbered from 1)
zh_cn: 字符串中要复制的第一个字符的位置(从1开始编号)

source: The position of the first character to remove.
zh_cn: 要移除的第一个字符的位置。

source: The position should be a value between 0 and 1 (you can use path_position, for example, if you need the current position of the instance) with 0 being the start position and 1 being the end.
zh_cn: 位置应该是0到1之间的值(例如，如果需要实例的当前位置，可以使用path_position)，其中0是开始位置，1是结束位置。

source: The position should be an real value between 0.0 and 1.0.
zh_cn: 位置应该是介于0.0和1.0之间的实数值。

source: The position to add the value, where 0 corresponds to the very beginning of the list and the final position is ds_list_size(id)-1.
zh_cn: 要添加值的位置，其中0对应于列表的最开始，最后一个位置是ds_list_size(id)-1。

source: The position to get the byte from.
zh_cn: 从中获取字节的位置。

source: The position to get the character code from.
zh_cn: 获取字符码的位置。

source: The position to get the character from.
zh_cn: 从中获取字符的位置。

source: The position to look at, where 0 corresponds to the very beginning of the list and the final position is ds_list_size(id)-1.
zh_cn: 要查看的位置，其中0对应于列表的最开始，最后一个位置是ds_list_size(id)-1。

source: The position to replace the value, where 0 corresponds to the very beginning of the list and the final position is ds_list_size(id)-1.
zh_cn: 替换值的位置，其中0对应于列表的最开始，最后一个位置是ds_list_size(id)-1。

source: The position to start the iteration from (allows negative values, from end of string).
zh_cn: 迭代开始的位置(允许负数，从字符串的末尾开始)。

source: The position will affect the sound in different ways depending on where the listener is positioned within the audio space too (default position is (0, 0, 0).
zh_cn: 位置也会以不同的方式影响声音，这取决于侦听器在音频空间中的位置(默认位置是(0，0，0)。

source: The position within the file for writing to is set to the last line of text that the file contains.
zh_cn: 写入到的文件中的位置设置为文件包含的最后一行文本。

source: The position within the list to check.
zh_cn: 要检查的列表中的位置。

source: The position within the list to mark.
zh_cn: 列表中要标记的位置。

source: The position within the list to set.
zh_cn: 列表中要设置的位置。

source: The position within the sequence (in frames) to set the playhead position to (can be a decimal value)
zh_cn: 将播放头位置设置为的序列(以帧为单位)中的位置(可以是一个十进制值)

source: The position within the string (starting at 1) to change the byte of.
zh_cn: 要更改字节的字符串中的位置(从1开始)。

source: The positions are absolute values, where the (0, 0) position corresponds to the top left corner of the sprite, regardless of the offset for the sprite, any "empty" pixels the sprite may have, or where it is being drawn in the room.
zh_cn: 位置是绝对值，其中(0,0)位置对应于精灵的左上角，而不考虑精灵的偏移量、精灵可能拥有的任何"空"像素或它在房间中的位置。

source: The possible return values are listed in the table below:
zh_cn: 可能的返回值如下表所示:

source: The post draw event.
zh_cn: 后绘制事件

source: The power of e.
zh_cn: e的幂。

source: The pre draw event.
zh_cn: 预绘制事件

source: The precision of all circles drawn after this function is called.
zh_cn: 调用此函数后绘制的所有圆的精度。

source: The precision of the path.
zh_cn: 路径的精确度。

source: The precision value (default 0.0000001)
zh_cn: 精度值(默认0.0000001)

source: The precision value that you can input into this function is the number of sides the circle polygon has, and this number can be anything between 4 and 64, but must be a number divisible by 4, with a default value of 24.
zh_cn: 您可以输入到此函数的精度值是圆多边形的边数，这个数字可以是4到64之间的任何数，但必须是能被4整除的数字，默认值为24。

source: The primitive base type.
zh_cn: 图元基本类型。

source: The primitive vertex format to use.
zh_cn: 要使用的图元顶点格式。

source: The priority of the value to add.
zh_cn: 要添加的值的优先级。

source: The process is as follows:
zh_cn: 流程如下:

source: The pulley joint is used to connect two instances within the physics world in such a way that moving one will directly influence the movement of the other.
zh_cn: 滑轮连接用于连接物理世界中的两个实例，其中一个的移动将直接影响另一个的移动。

source: The purpose of delta timing is to eliminate the effects of the lag or slowness of computers that try to handle complex graphics or a lot of code.
zh_cn: 增量计时的目的是消除计算机在处理复杂图形或大量代码时产生的滞后或慢的影响。

source: The quantity of the new particle to create at the particle death.
zh_cn: 粒子死亡时创建的新粒子的数量。

source: The quantity of the new particle to create per step.
zh_cn: 每步要创建的新粒子的数量。

source: The question to ask to the user.
zh_cn: 向用户提出的问题。

source: The queue index is the value returned when you created the queue using the function audio_create_play_queue(), and this function should be called when the queue is no longer required to prevent memory leaks.
zh_cn: 队列索引是使用函数audio_create_play_queue()创建队列时返回的值，当不再需要队列时应该调用此函数以防止内存泄漏。

source: The radians to convert.
zh_cn: 要转换的弧度。

source: The radius (distance from center to edge) of the circle in pixels.
zh_cn: 圆的半径(从中心到边缘的距离)，以像素为单位。

source: The radius (distance in pixels from its center to its edge).
zh_cn: 半径(从中心到边缘的像素距离)。

source: The radius (in pixels) of the circle to create.
zh_cn: 要创建的圆的半径(以像素为单位)。

source: The radius (in pixels) of the circular area to delete.
zh_cn: 要删除的圆形区域的半径(以像素为单位)。

source: The radius (in pixels) of the particle fixture.
zh_cn: 粒子设备的半径(以像素为单位)。

source: The radius around the center point in which to check for a collision.
zh_cn: 检查碰撞的中心点周围的半径。

source: The radius of the circle.
zh_cn: 圆的半径。

source: The radius of the curve along the x axis from the rectangle corners.
zh_cn: 从矩形角到x轴的曲线的半径。

source: The radius of the curve along the y axis from the rectangle corners.
zh_cn: 曲线的半径沿y轴从矩形的角。

source: The radius of the disk in the grid.
zh_cn: 圆盘在网格中的半径。

source: The radius of the disk on the grid.
zh_cn: 圆盘在网格上的半径。
